{
    "portfolio": {
        "named": "Julian Bristol",
        "initials": "JB",
        "img": "https://res.cloudinary.com/dfb1oxmpx/image/upload/v1684783391/FaceBlog%20App/PXL_20221002_135603827_2_nqm1ok.jpg",
        "alt": "Julian Bristol's profile picture",
        "faceblog": "/Account",
        "jobTitle": "Front End Developer",
        "employer": "Lykka Village",
        "employerLink": "https://lykka.org/",
        "school": "Capella University",
        "schoolLink": "https://capella.edu/",
        "graduationDate": "2022-09-30",
        "home": "NYC, New York",
        "homeLink": "https://goo.gl/maps/vEPLL8zREfDD56998",
        "relationship": "Single",
        "relationshipLink": "http://localhost:3000/Pages",
        "friends": [
            "/users/JulianBristol",
            "/users/JulianBristol",
            "/users/JulianBristol",
            "/users/JulianBristol",
            "/users/JulianBristol",
            "/users/JulianBristol",
            "/users/JulianBristol",
            "/users/JulianBristol",
            "/users/JulianBristol",
            "/users/JulianBristol",
            "/users/JulianBristol",
            "/users/JulianBristol",
            "/users/JulianBristol",
            "/users/JulianBristol",
            "/users/JulianBristol",
            "/users/JulianBristol",
            "/users/JulianBristol",
            "/users/JulianBristol",
            "/users/JulianBristol",
            "/users/JulianBristol",
            "/users/JulianBristol",
            "/users/JulianBristol",
            "/users/JulianBristol"
        ],
        "website": "https://www.julianbristol.netlify.app/",
        "websiteName": "PortfolioPage",
        "github": "https://github.com/JulianBristol",
        "linkedin": "https://www.linkedin.com/in/julianbristol/",
        "email": "bristoljulian.r@gmail.com",
        "emailLink": "bristoljulian.r+promotions@gmail.com",
        "phone": "4753299736",
        "dob": "1992-07-04",
        "about": [
            "Passionate and results-driven professional with a diverse background in transportation security and software development. I bring a unique perspective and a strong commitment to excellence in every endeavor. Dedicated to continuously expanding my skills and knowledge to drive innovative solutions in the technology field.",
            "What sparked my interest in software development and led me to pursue a specialization in this field is my long-standing dream to have the knowledge and ability to manipulate computers using programming. This passion has been a driving force behind my pursuit of a bachelor's degree in Information Technology with a specialization in software development.",
            "My experience as a transportation security officer with TSA has significantly contributed to my growth and development as a professional. It taught me the importance of teamwork and how a well-functioning team can move mountains. This experience has instilled in me a dedication to ensuring seamless human-to-human connections in all my endeavors.",
            "During my studies and professional career, a significant project that had a profound impact on my skills and knowledge in software development was an internship turned temporary job position. It introduced me to the world of React and JavaScript, opening my eyes to new programming languages and igniting my love for continuous learning. I believe that in the ever-evolving world of technology, there will always be new things to explore and discover.",
            "To stay up-to-date with the latest advancements and trends in the technology industry, I actively engage in reading news articles, such as Tech Brew, to stay informed. Additionally, I enjoy following tutorials on YouTube to build new projects, which not only keeps me updated but also allows me to practice and enhance my skills.",
            "In the software development field, I am motivated by the challenges and problems that need to be solved. Building websites and programming them is not only a professional pursuit but also an entertaining and leisurely activity for me. When faced with difficult problems, I approach them with an educated guess as a first step. If that doesn't work, I use console logs to debug and analyze the issue. If further assistance is needed, I turn to the internet for similar problems and also rely on my network of friends and coworkers for support and guidance."
        ]
    },
    "blog": {
        "named": "Julian R. Bristol",
        "initials": "JB",
        "img": "https://res.cloudinary.com/dfb1oxmpx/image/upload/v1684783381/FaceBlog%20App/Professional_Profile_Picture_wl83ka.jpg",
        "alt": "Julian Bristol's profile picture",
        "faceblog": "/users/JulianBristol"
    }
}